app/controllers/api/v1/orders_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 1
SELECT "products".* FROM "products" WHERE "products"."id" IN (20, 23)
---
  def index
    @orders = current_user.orders.includes(:order_items, :products).recent
    @orders = @orders.by_status(params[:status]) if params[:status].present?

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
  def current_user
    # Placeholder - implement authentication
    User.first || User.create!(
      email: "test@example.com",
      password: "password",
      first_name: "Test",
      last_name: "User"
    )