app/controllers/api/v1/products_controller.rb

  def index
    @products = Product.includes(:category)

    # Apply filters
    @products = @products.by_category(params[:category_id]) if params[:category_id].present?
    @products = @products.available if params[:available] == "true"
    @products = @products.price_range(params[:min_price], params[:max_price]) if params[:min_price] && params[:max_price]

    # Apply search
    if params[:search].present?
      @products = @products.where("name ILIKE ?", "%#{params[:search]}%")
    end

    # Pagination
    page = params[:page] || 1
    per_page = params[:per_page] || 10
    @products = @products.page(page).per(per_page)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (5, 6, 7)
SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products" LIMIT 10 OFFSET 0